[
    {
        "Title": "7Tran",
        "Summary": "An online learning platform developed for a centralized driving school management system.",
        "Image": "7tran.png",
        "Description": "This project is an online learning platform developed for a centralized driving school management system, designed to streamline the delivery and administration of virtual classes. The frontend was built using Angular, providing a responsive and intuitive user interface, while the backend API was developed with ASP.NET, exposing a robust set of RESTful endpoints. Data persistence and management were handled through SQL Server, ensuring high performance and reliability.\n\nThe platform integrated facial recognition technology to verify student identity during online sessions, enhancing both security and compliance. Additionally, it leveraged SignalR to implement real-time WebSocket communication, enabling instant chatbox updates and seamless interaction between students and instructors.\n\nI contributed across the entire technology stack, from designing and implementing frontend components, building and optimizing backend endpoints, to managing and tuning the database schema. Beyond coding, I actively participated in technical architecture discussions, focusing on scalability, application security best practices, and performance optimization to ensure a robust and future-proof solution."
    },
    {
        "Title": "Arbosis",
        "Summary": "A mobile application developed for the Federal Rural University of Rio de Janeiro (UFRRJ), designed to catalog, monitor, and search for urban trees across the city of Rio de Janeiro.",
        "Image": "Arbosis.png",
        "Description": "A mobile web application built for the Federal Rural University of Rio de Janeiro (UFRRJ) to catalog, monitor, and search urban trees across Rio de Janeiro. The frontend was developed with Angular and delivered as a Progressive Web App, which allowed the app to run both online and offline. Core PWA capabilities included a service worker, offline caching of UI and data, and background sync so field entries created without connectivity could be queued and uploaded once a connection was restored.\n\nThe app integrated GPS APIs to capture precise geolocation for each tree in real time. Field users could photograph specimens directly in the app, attach notes, and submit records with coordinates. Because image capture was frequent and network conditions varied, I implemented image loading and delivery optimizations, including client-side resizing and compression at capture time, lazy loading in lists and galleries, and responsive image variants. On the backend, images were stored in AWS S3 with CDN distribution for fast global delivery, proper cache control headers, and content hashing to maximize cache hits.\n\nThe platform exposed a RESTful API built with ASP.NET and persisted data in SQL Server. The API handled authentication, validation, rate limiting, and robust error handling. Database design focused on performance and reliability, with indexes to accelerate common queries such as filtering by species, date range, and distance. Administrative tools supported data review and bulk operations, while the public endpoints powered geosearch and analytics features in the UI.\n\nI worked across the entire stack from Angular components and PWA architecture to API design and database modeling. I also led the project, contributing to technical architecture decisions, security practices, and performance optimization, coordinating the work from discovery through delivery to ensure a stable, scalable, and maintainable solution."
    },
    {
        "Title": "Numeric Calculator",
        "Summary": "A website I developed as a favor for my university, compiling educational content on Numerical Calculus along with interactive simulators for various numerical methods.",
        "Image": "calculadoraNumerica.png",
        "Description": "A simple yet academically rich website I developed to help future students succeed in a university course I personally enjoyed but noticed many struggled with. From a technical standpoint, the site is purely frontend-based, without any backend or external API dependencies. Its value lies in the 100% original academic content I authored myself, in consultation with the course professor, ensuring both accuracy and clarity.\n\nThe site covers the following topics: Taylor polynomials, roots of real-valued functions, initial value problems, linear systems, interpolation, boundary value problems, curve fitting, and numerical integration. Each topic includes interactive simulators fully developed by me, without relying on any third-party libraries or APIs. These simulators not only perform the computations but also provide a step-by-step breakdown of the process in a clear and didactic manner, serving as a hands-on learning tool.\n\nThe university appreciated the project so much that they decided to host it under their official domain: calculadora-numerica.ic.ufrj.br. This recognition leaves a lasting mark of my contribution to the institution—a legacy that will continue to support students for years to come."
    }
]
